DESAFIO 14/testing/artillery/result_cluster.txt
Phase started: unnamed (index: 0, duration: 1s) 12:37:26(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 12:37:28(-0300)

--------------------------------------
Metrics for period to: 12:37:30(-0300) (width: 1.685s)
--------------------------------------

http.codes.200: ................................................................ 2000
http.request_rate: ............................................................. 1200/sec
http.requests: ................................................................. 2000
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 138
  median: ...................................................................... 19.9
  p95: ......................................................................... 74.4
  p99: ......................................................................... 85.6
http.responses: ................................................................ 2000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 588.7
  max: ......................................................................... 1436.7
  median: ...................................................................... 1153.1
  p95: ......................................................................... 1408.4
  p99: ......................................................................... 1436.8


All VUs finished. Total time: 3 seconds

--------------------------------
Summary report @ 12:37:30(-0300)
--------------------------------

http.codes.200: ................................................................ 2000
http.request_rate: ............................................................. 1200/sec
http.requests: ................................................................. 2000
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 138
  median: ...................................................................... 19.9
  p95: ......................................................................... 74.4
  p99: ......................................................................... 85.6
http.responses: ................................................................ 2000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 588.7
  max: ......................................................................... 1436.7
  median: ...................................................................... 1153.1
  p95: ......................................................................... 1408.4
  p99: ......................................................................... 1436.8