DESAFIO 14/testing/artillery/result_fork.txt
Phase started: unnamed (index: 0, duration: 1s) 12:11:48(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 12:11:49(-0300)

--------------------------------------
Metrics for period to: 12:11:50(-0300) (width: 1.256s)
--------------------------------------

http.codes.200: ................................................................ 1930
http.request_rate: ............................................................. 1554/sec
http.requests: ................................................................. 1938
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 44
  median: ...................................................................... 7
  p95: ......................................................................... 19.1
  p99: ......................................................................... 34.8
http.responses: ................................................................ 1930
vusers.completed: .............................................................. 41
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 92
  max: ......................................................................... 568.4
  median: ...................................................................... 391.6
  p95: ......................................................................... 550.1
  p99: ......................................................................... 561.2


--------------------------------------
Metrics for period to: 12:12:00(-0300) (width: 0.085s)
--------------------------------------

http.codes.200: ................................................................ 70
http.request_rate: ............................................................. 62/sec
http.requests: ................................................................. 62
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 19
  median: ...................................................................... 6
  p95: ......................................................................... 18
  p99: ......................................................................... 18
http.responses: ................................................................ 70
vusers.completed: .............................................................. 9
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 361.1
  max: ......................................................................... 437.9
  median: ...................................................................... 415.8
  p95: ......................................................................... 424.2
  p99: ......................................................................... 424.2


All VUs finished. Total time: 3 seconds

--------------------------------
Summary report @ 12:11:52(-0300)
--------------------------------

http.codes.200: ................................................................ 2000
http.request_rate: ............................................................. 808/sec
http.requests: ................................................................. 2000
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 44
  median: ...................................................................... 7
  p95: ......................................................................... 19.1
  p99: ......................................................................... 34.8
http.responses: ................................................................ 2000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 92
  max: ......................................................................... 568.4
  median: ...................................................................... 391.6
  p95: ......................................................................... 539.2
  p99: ......................................................................... 561.2